// トリガーの名前と種類

export const triggerNameAndType = {
  "ATTACK TRIGGER" : [
    "弧月",
    "スコーピオン",
    "レイガスト"
  ],
  "GUNNER TRIGGER" : [
    "アステロイド",
    "ハウンド",
    "メテオラ",
    "バイパー",
    "アステロイド：拳銃",
    "バイパー：拳銃",
    "アステロイド：突撃銃",
    "ハウンド：突撃銃",
    "バイパー：突撃銃",
    "アステロイド：機関砲",
  ],
  "SNIPER TRIGGER" : [
    "アイビス",
    "イーグレット",
    "ライトニング"
  ],
  "DEFFENSE TRIGGER" : [
    "シールド",
    "エスクード"
  ],
  "OPTION TRIGGER" : [
    "バッグワーム",
    "カメレオン",
    "グラスホッパー",
    "スパイダー",
    "スラスター",
    "旋空",
    "鉛弾",
    "ダミービーコン(試作)",
    "ガイスト(試作)",
    "フルアームズ(試作)"
  ]
};
